"""Модуль для разработки функции выбора предистории"""
predistor = {'предистория1': 'описание 1',
             'предистория2': 'описание 2',
             'предистория3': 'описание 3',
             'предистория4': 'описание 4',
             'предистория5': 'описание 5',
             'предистория6': 'описание 6',
             'предистория7': 'описание 7',
             'предистория8': 'описание 8',
             'предистория9': 'описание 9',
             'предистория10': 'описание 10',
             'предистория11': 'описание 11',
             'предистория12': 'описание 12',
             'предистория13': 'описание 13'}

ACTIVE = True
while ACTIVE:
    print('=' * 15 + 'создание персонажа' + '=' * 15)
    print('=' * 15 + 'выбор предистории ' + '=' * 15)
    for k, v in predistor.items():
        print(k)
        ACTIVE = False
