""" # функция добавления имени я словарь
name = input('введите имя персонажа')
agree = input('вам нравится имя?').lower().strip()
while True:
    if agree == 'да' or agree == 'yes':
        saved_inf()
        break
    elif agree == 'нет' or agree =='no':
        print('введите имя снова')
        break
    else:
        print('выполнен не корректный ввод данных.\n Повторите ввод') #
          хз что это          добавить функцию записывания имения персонажа"""


# тестирование программы на ввод словаря в список
predistor = {'предистория1': 'описание 1',
             'предистория2': 'описание 2',
             'предистория3': 'описание 3',
             'предистория4': 'описание 4',
             'предистория5': 'описание 5',
             'предистория6': 'описание 6',
             'предистория7': 'описание 7',
             'предистория8': 'описание 8',
             'предистория9': 'описание 9',
             'предистория10': 'описание 10',
             'предистория11': 'описание 11',
             'предистория12': 'описание 12',
             'предистория13': 'описание 13'}

warrior = {
    'описание': 'текст1',
    'умения': {'боевой стиль': 'Описание1',
               'второе дыхание': 'Описание2'}
}

rase = {'human': 'describe'}
characters: list[dict] = []
character: dict[str, str | None] = {'name': None,
                                    'rase': None,
                                    'predistor': None}

CH_MSG = "что вы хотите сделать?\n"
CH_MSG += "Выбрать имя\n"
CH_MSG += "Выбрать расу\n"
CH_MSG += "Выбрать класс\n"
CH_MSG += "Выбрать предимторию\n"
CH_MSG += "Для смена режима редактирования введите соответсвующее действие\n"
CH_MSG += "Для завершения введите X или выйти\n"
# код для создания персонажа а именно заполнения имени
# написать код выбора этапа например 1 пункт выбор имени и тд
"""while True:"""
    # добавление функции отчистки экрана 48
print('=' * 15 + 'Создание персонажа' + '=' * 15)
print('=' * 18 + 'Выбор имени' + '=' * 18)
print('Для выхода напишите "выход"')
    # выбор имени персонажа
while True:
    NAME = str(input('выберите имя персонажа:\n'))
    AGREE = input('вам нравится имя?\n').lower().strip()
    if AGREE == 'да' or AGREE == 'yes':
        for k, v in character.items():
            character['name'] = NAME
            """print(character)"""  # отображение всего словаря
            print(f"ваше имя: {character['name']}")
            break
    elif AGREE == 'нет' or AGREE == 'no':
        print('повторите ввод имени')
    elif AGREE == 'X' or AGREE == 'выйти':
        break
    else:
        print('выполнен не корректный ввод.\n Повторите подтверждение.')
