"""обработчик событий создания персонажа.
здесь располоджены функции для создания персонажа
при создании берет объект самого персонажа из
соответствущего файла.
ожидаемый результат - успещная сериализация данных в json файл"""
import json  # мб это тут нах не нужно пересмотреть
import os
import some_function as sf
import common_fucntion as cf

# условно тут будет какая нить функция запуска всей программы
# которяа будет иметь переменную с путем к папке.
# тут будет присутсововать функция которая (хз забыл)


# крч надо вынести в charactermaker путь к файлам
# нахуя обработчику событий блять расположение к джсону ну максимум бля
# сохранение файлов
def run_character_maker():
    """запуск страницы создания персонажа"""
    # путь к файлам где будут распаолагаться как информация
    # для создания так и уже созданные персонажи
    way_to_dir = os.path.dirname(os.path.abspath(__file__)) # не нравится функция. пересмотреть. прописать относительный путь ТУПО ДЛЯ ПОНИМАНИЯ
    races_inf = sf.read_n_load_info(os.path.join(way_to_dir, "races.json"))
    bground_inf = sf.read_n_load_info(os.path.join(way_to_dir, "bground.json"))
    while True:
        cf.clean_screen()
        cf.header()
        actions = ["выход",  # 1
                   "сгенерировать характеристики",  # 2
                   "выбрать имя персонажу",  # 3
                   "выбрать расу и подрасу",  # 4
                   "выбрать класс",  # 5
                   "выбрать подкласс",  # 6
                   "выбрать предисторию",  # 7
                   "осмотреть инвентарь",  # 8
                   "сохранить данные",  # 9
                   "сбросить"]  # 10
        cf.user_chose(actions)
        user_choose = input("Ваш выбор: ").strip()
        match user_choose:
            case "1":
                break
            case "2":
                sf.generation_of_characteristics()
                print("заглушка")
            case "3":
                print("заглушка")
            case "4":
                print("заглушка")
            case "5":
                print("заглушка")
            case "6":
                print("заглушка")
            case "7":
                print("заглушка")
            case "8":
                print("заглушка")
